# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd
import warnings

warnings.filterwarnings('ignore')

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
Series1 = pd.Series(np.random.randint(1 , 5 , 100 , dtype='l'))
Series2 = pd.Series(np.random.randint(1 , 4 , 100 , dtype='l'))
Series3 = pd.Series(np.random.randint(10000 , 30001 , 100 , dtype='l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:

house = pd.concat([Series1,Series2 ,Series3] , axis=1)
house.head()

   0  1      2
0  2  3  22697
1  1  2  13286
2  2  1  21128
3  1  2  17445
4  3  2  20922

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:

house.rename(columns={0 : 'bedrs' , 1 : 'barths' , 2 : 'price_sqr_meter'} , inplace=True)
house.head()

   bedrs  barths  price_sqr_meter
0      2       3            22697
1      1       2            13286
2      2       1            21128
3      1       2            17445
4      3       2            20922

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:

bigcolumn =pd.concat([Series1 , Series2 , Series3],  axis=0)
bigcolumn = bigcolumn.to_frame()
bigcolumn.info()

<class 'pandas.core.frame.DataFrame'>
Index: 300 entries, 0 to 99
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       300 non-null    int32
dtypes: int32(1)
memory usage: 3.5 KB

In [6]:
bigcolumn

        0
0       2
1       1
2       2
3       1
4       3
..    ...
95  27942
96  10939
97  20246
98  17656
99  19672

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [9]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [8]:

bigcolumn.reset_index(drop=True , inplace=True)
bigcolumn

         0
0        2
1        1
2        2
3        1
4        3
..     ...
295  27942
296  10939
297  20246
298  17656
299  19672

[300 rows x 1 columns]